&НаКлиенте
Процедура ПодсчётСуммы()
	Строка = Элементы.СписокТоваров.ТекущиеДанные;	
	Строка.Сумма = Строка.Количество * Строка.Цена;
	Если ЗначениеЗаполнено(Строка.Скидка) И ЗначениеЗаполнено(Строка.Номенклатура) Тогда
		Строка.Сумма = Строка.Сумма - Строка.Сумма / 100 * Строка.Скидка
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровКоличествоПриИзменении(Элемент)
	Строка = Элементы.СписокТоваров.ТекущиеДанные;	
	Если ЗначениеЗаполнено(Строка.Номенклатура) Тогда
		ПодсчётСуммы();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучениеЦеныТовара(Товар)
	Отбор = Новый Структура("Номенклатура", Товар);
	ПоследняяЗапись = РегистрыСведений.ЦеныНоменклатуры.ПолучитьПоследнее(ТекущаяДата(), Отбор);
	
	Если ПоследняяЗапись = Неопределено Тогда
        Возврат 0;
	КонецЕсли;
	
	Возврат ПоследняяЗапись.Цена;
КонецФункции

&НаКлиенте
Процедура СписокТоваровСкидкаПриИзменении(Элемент)
	Строка = Элементы.СписокТоваров.ТекущиеДанные;
	 		
	Если Строка.Скидка > 100 Тогда
		Строка.Скидка = 0;
		Сообщить("Скидка не может быть больше 100");
	КонецЕсли;
		                                              
	ПодсчётСуммы(); 	
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровНоменклатураПриИзменении(Элемент)
	Строка = Элементы.СписокТоваров.ТекущиеДанные;
	Строка.Цена = ПолучениеЦеныТовара(Строка.Номенклатура);
	
	Если ЗначениеЗаполнено(Строка.Количество) Тогда
		ПодсчётСуммы();
	КонецЕсли;
	
КонецПроцедуры
