
&НаСервере
Функция ПередЗаписьюНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ Справочник.Номенклатура КАК Номенклатура
	|УПОРЯДОЧИТЬ ПО 
	|	Номенклатура.Ссылка УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ПоследнийТовар = Выборка.Ссылка;
		ПоследнийАртикулЧисло = Прав(ПоследнийТовар.Артикул, 9);
		НовыйАртикулЧисло = Число(ПоследнийАртикулЧисло) + 1;
		НовыйАртикул = "S" + Формат(НовыйАртикулЧисло, "ЧЦ=9; ЧВН=; ЧГ=0");
	Иначе
		НовыйАртикул = "S000000001";
	КонецЕсли;
	
	Возврат НовыйАртикул;
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	НовыйАртикул = ПередЗаписьюНаСервере();
	Объект.Артикул = НовыйАртикул;
КонецПроцедуры
