&НаКлиенте
Процедура ПроцентНаценкиПриИзменении(Элемент)
	Если ПроцентНаценки > 100 Тогда
		Сообщить("Наценка не может быть больше 100 процентов!");
		ПроцентНаценки = 0;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УвеличитьНаСервере(ПроцентНаценки)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
    |    Цены.Номенклатура,
    |    Цены.Цена
    |	ИЗ
    |   	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата, ) КАК Цены";

	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Выборка = Запрос.Выполнить().Выбрать();
	
	НаборЗаписей = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(ТекущаяДата());
	
	Пока Выборка.Следующий() Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = ТекущаяДата();
		НоваяЗапись.Номенклатура = Выборка.Номенклатура;
		НоваяЗапись.Цена = Выборка.Цена + Выборка.Цена * ПроцентНаценки / 100 ;
	КонецЦикла;
	НаборЗаписей.Записать();
КонецПроцедуры

&НаКлиенте
Процедура Увеличить(Команда)
	Если ЗначениеЗаполнено(ПроцентНаценки) Тогда
		УвеличитьНаСервере(ПроцентНаценки);
		Сообщить("Цены изменены");
	Иначе
		Сообщить("Введите процент наценки!");
	КонецЕсли;
КонецПроцедуры
