
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиТоваров Расход
	
	СписокНоменклатуры = Новый СписокЗначений;
	Для Каждого Строка Из СписокТоваров Цикл
		СписокНоменклатуры.Добавить(Строка.Номенклатура);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	| Остатки.Номенклатура КАК Номенклатура,
	| Остатки.КоличествоОстаток КАК Количество
	|ИЗ
	| РегистрНакопления.ОстаткиТоваров.Остатки(
	|	&Дата,
	|	Склад = &Склад
	|	И Номенклатура В (&СписокНоменклатуры)) КАК Остатки";
	
	Запрос.УстановитьПараметр("Дата", Дата);
    Запрос.УстановитьПараметр("Склад", Склад);
    Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
	
	Выборка = Запрос.Выполнить().Выбрать();
	ОстаткиПоТоварам = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		ОстаткиПоТоварам.Вставить(Выборка.Номенклатура, Выборка.количество);
	КонецЦикла;
	
	Для Каждого Строка Из СписокТоваров Цикл
		Остаток = ОстаткиПоТоварам[Строка.Номенклатура];
		
        Если Остаток = Неопределено Тогда
            Остаток = 0;
		КонецЕсли;
		
		 Если Остаток < Строка.Количество Тогда
            Сообщить("Недостаточно товара " + Строка.Номенклатура + 
                     ". На складе: " + Остаток + ", требуется: " + Строка.Количество);
            Отказ = Истина;
            Возврат;
        КонецЕсли;
	КонецЦикла;
	
	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаСписокТоваров Из СписокТоваров Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаСписокТоваров.Номенклатура;
		Движение.Склад = Склад;
		Движение.Количество = ТекСтрокаСписокТоваров.Количество;
	КонецЦикла;

	// регистр Продажи 
	Движения.Продажи.Записывать = Истина;
	Для Каждого ТекСтрокаСписокТоваров Из СписокТоваров Цикл
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаСписокТоваров.Номенклатура;
		Движение.Склад = Склад;
		Движение.Покупатель = Покупатель;
		Движение.Количество = ТекСтрокаСписокТоваров.Количество;
		Движение.Сумма = ТекСтрокаСписокТоваров.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
