&НаСервере
Процедура ПолучениеДанных()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ 
	|	Продажи.Покупатель КАК Покупатель, 
	|	СУММА(Продажи.СуммаОборот) КАК Сумма
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода,,) КАК Продажи
	|СГРУППИРОВАТЬ ПО
	|	Продажи.Покупатель";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("КонецПериода", ТекущаяДата());
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Сообщить("Строк в результате запроса: " + Таблица.Количество());	
	Результат.Загрузить(Таблица);
КонецПроцедуры

&НаКлиенте
Процедура Посчитать()
	ПолучениеДанных();
КонецПроцедуры;